Revit 2027 API
BuiltInFailures.EditingFailures.CannotEditElements Property
 Workset is editable, but you can't edit the element until '[Borrowers]' resaves the element to central and relinquishes it and you Reload Latest.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotEditElements { get; }
Public Shared ReadOnly Property CannotEditElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotEditElements {
	FailureDefinitionId^ get ();
}
static member CannotEditElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace